# 13 Konversi nilai numerik ke dalam sejumlah kategori

## Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    79
1    72
2    75
3    53
4     7
5    67
6    77
7    19
8    49
9    25

## Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan `cut()`

In [3]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    79        manula
1    72        manula
2    75        manula
3    53        dewasa
4     7          anak
5    67        manula
6    77        manula
7    19        dewasa
8    49        dewasa
9    25        dewasa